local _G = GLOBAL

--蓝图列表
local blueprint_list ={
    ["鹅毛扇"]="鹅毛扇：麋鹿鹅 50%",
    ["旋风"]="旋风：麋鹿鹅 50%",
    ["浮木船桨"]="浮木船桨：麋鹿鹅 5%",
    ["雪球发射器"]="雪球发射器：蚁狮 100%",
    ["隔热包"]="隔热包：熊獾 50%",
    ["熊皮背心"]="熊皮背心：熊獾 50%",
    ["眼球伞"]="眼球伞：独眼巨鹿 100%",
    ["龙鳞盔甲"]="龙鳞盔甲：龙蝇 100%",
    ["龙鳞宝箱"]="龙鳞宝箱：龙蝇 100%",
    ["龙鳞地毯"]="龙鳞背包：龙蝇 100%",
    ["生命护符"]="生命护符：女王蜂 100%",
    ["背包"]="背包：克劳斯 100%",
    ["冰箱"]="冰箱：毒菌蟾蜍 100%",
    ["烹饪锅"]="烹饪锅：远古守卫者 100%",
    ["月相盘"]="月相盘：三基佬 50%",
    ["排箫"]="排箫：三基佬 50%",
    ["箱子"]="箱子：树精守卫 10% 采集洞穴香蕉树 2.5%",
    ["船只套件"]="船只套件：树精守卫 5%",
    ["船桨"]="船桨：树精守卫 5%",
    ["衣柜"]="衣柜：桦树精 20%",
    ["浇水壶"]="浇水壶：桦树精 20%",
    ["帐篷"]="帐篷：蜘蛛女王 20%",
    ["狗牙陷阱"]="狗牙陷阱：座狼 50%",
    ["厚皮毛"]="厚皮毛：钢羊 25%",
    ["制图台"]="制图台：钢羊 25%",
    ["猪人房"]="猪人房：猪人 10%",
    ["橄榄球头盔"]="橄榄球头盔：猪人 5%",
    ["毛皮铺盖"]="毛皮铺盖：兔人 10%",
    ["兔子窝"]="兔子窝：兔人 5%",
    ["草叉"]="草叉：兔人 5%",
    ["强心针"]="强心针：鱼人 5%",
    ["渔具工作台"]="渔具工作台：鱼人 1%",
    ["刷子"]="刷子：小海象 20%",
    ["步行手杖"]="步行手杖：海象/小海象 20% 无眼鹿 10%",
    ["紫宝石"]="紫宝石：月树 15% 发条生物 10%",
    ["方格地板"]="方格地板：发条生物 10%",
    ["捕鸟器"]="捕鸟器：蜘蛛 5%",
    ["养蜂人的帽子"]="养蜂人的帽子：蜘蛛 5%",
    ["迷你指示牌"]="迷你指示牌：蜘蛛战士 10%",
    ["治疗药膏"]="治疗药膏：洞穴蜘蛛/喷射蜘蛛 5%",
    ["缝纫工具包"]="缝纫工具包：穴居悬蛛 5%",
    ["桅杆套件"]="桅杆套件：碎片蜘蛛 2.5%",
    ["小巧背心"]="小巧背心：猎犬 5%",
    ["剃刀"]="剃刀：猎犬 5%",
    ["火魔杖"]="火魔杖：红色猎犬 5%",
    ["冰魔杖"]="冰魔杖：蓝色猎犬 5%",
    ["寒冰护符"]="寒冰护符：蓝色猎犬 5%",
    ["兔毛耳套"]="兔毛耳套：兔子 5%",
    ["噩梦燃料"]="噩梦燃料：兔子 5%",
    ["肉块雕像"]="肉块雕像：兔子 5%",
    ["雨伞"]="雨伞：青蛙 5%",
    ["钓竿"]="钓竿：青蛙 5%",
    ["海钓竿"]="海钓竿：青蛙 1%",
    ["鞍"]="鞍：火鸡 10%",
    ["三尾猫的教诲"]="三尾猫的教诲：浣猫 5%",
    ["猫帽"]="猫帽：浣猫 5%",
    ["鼹鼠帽"]="鼹鼠帽：鼹鼠 5%",
    ["蝙蝠斧棍"]="蝙蝠斧棍：黑蝙蝠 5%",
    ["便携秤"]="便携秤：淡水鱼 5%",
    ["自动鱼秤"]="自动鱼秤：海水鱼 2%",
    ["农产品秤"]="农产品秤：巨型作物 1%",
    ["种子袋"]="种子袋：巨型作物 1%",
    ["鱼箱"]="鱼箱：海水鱼 2%",
    ["提灯"]="提灯：荧光草/疾行乌贼 1%",
    ["吹箭"]="吹箭：雪雀 10% 疾行乌贼 1%",
    ["电磁吹箭"]="电磁吹箭：金丝雀 20%",
    ["羽毛笔"]="羽毛笔：乌鸦 5%",
    ["羽毛帽"]="羽毛帽：乌鸦 5%",
    ["燃烧吹箭"]="燃烧吹箭：红雀 5%",
    ["友善的稻草人"]="友善的稻草人：红雀 5%",
    ["寒冬帽"]="寒冬帽：雪雀 10%",
    ["木门"]="木门：秃鹫 10%",
    ["鸟笼"]="鸟笼：高脚鸟/秃鹫 10%",
    ["冰块"]="冰块：企鹅 5%",
    ["牛帽"]="牛帽：皮弗娄牛 10%",
    ["地毯地板"]="地毯地板：皮弗娄牛 10%",
    ["夏日背心"]="夏日背心：考拉象 20%",
    ["寒冬背心"]="寒冬背心：考拉象 20%",
    ["电器元件"]="电器元件：伏特羊 15%",
    ["避雷针"]="避雷针：伏特羊 15%",
    ["长矛"]="长矛：触手 10%",
    ["蜜蜂地雷"]="蜜蜂地雷：触手 10%",
    ["火药"]="火药：大触手 10%",
    ["蜂箱"]="蜂箱：蜜蜂 2.5%",
    ["蜂蜜药膏"]="蜂蜜药膏：蜜蜂 2.5%",
    ["捕虫网"]="捕虫网：石果灌木 5% 杀人蜂 2%",
    ["蜂蜡"]="蜂蜡：杀人蜂 2%",
    ["闪亮之鞍"]="闪亮之鞍：蝴蝶 2%",
    ["浴血战鞍"]="浴血战鞍：蝴蝶 2%",
    ["水球"]="水球：蚊子 5%",
    ["回旋镖"]="回旋镖：草蜥蜴(已禁止) 10%",
    ["麻醉吹箭"]="麻醉吹箭：草蜥蜴(已禁止) 10%",
    ["舵轮套件"]="舵轮套件：草蜥蜴(已禁止) 10%",
    ["耕地机"]="耕地机：肉球茎 10%",
    ["堆肥桶"]="堆肥桶：肉球茎 10%",
    ["高礼帽"]="高礼帽：暴躁猴 5%",
    ["晨星"]="晨星：暴躁猴 5%",
    ["木甲"]="木甲：蜗龟/蛞蝓龟 5%",
    ["暖火石"]="暖火石：岩石大龙虾 25%",
    ["锚套件"]="锚套件：岩石大龙虾 10%",
    ["饥饿腰带"]="饥饿腰带：缀食者 5%",
    ["船只补丁"]="船只补丁：缀食者 10%",
    ["吸热篝火"]="吸热篝火：深渊蠕虫 10%",
    ["矿工帽"]="矿工帽：深渊蠕虫 10%",
    ["独奏乐器"]="独奏乐器：坎普斯 20%",
    ["传送魔杖"]="传送魔杖：鬼魂 20%",
    ["传送核心"]="传送核心：鬼魂 20%",
    ["梦魇护符"]="梦魇护符：爬行的梦魇 5%",
    ["暗影之剑"]="暗影之剑：梦魇巨喙 5%",
    ["暗影盔甲"]="暗影盔甲：梦魇巨喙 5%",
    ["蜡纸"]="蜡纸：无眼鹿 10%",
    ["雨帽"]="雨帽：幼麋鹿鹅 10%",
    ["雨衣"]="雨衣：幼麋鹿鹅 10%",
    ["稻草卷"]="稻草卷：坚果精 5%",
    ["黄金铲子"]="黄金铲子：月岛树苗 10% 石化树 5%",
    ["指示牌"]="指示牌：石化树 5%",
    ["吸热营火"]="吸热营火：卵石 2.5%",
    ["舔盐器"]="舔盐器：卵石 2.5%",
    ["石墙"]="石墙：岩石 2.5%",
    ["黄金鹤嘴锄"]="黄金鹤嘴锄：金矿石 5%",
    ["带孔月岩"]="带孔月岩：月岩矿 10%",
    ["月岩墙"]="月岩墙：月岩矿 10%",
    ["盐箱"]="盐箱：盐柱 1%",
    ["石砖块"]="石砖块：宽石笋 5%",
    ["卵石路"]="卵石路：尖石笋 2.5%",
    ["绳索"]="绳索：草 1%",
    ["木墙"]="木墙：草 1%",
    ["铲子"]="铲子：多枝的树 2.5% 树苗 1%",
    ["园艺锄"]="园艺锄：多枝的树 2.5% 树苗 1%",
    ["雨量计"]="雨量计：花 2%",
    ["温度测量计"]="温度测量计：花 2%",
    ["木板"]="木板：树 1%",
    ["木质地板"]="木质地板：树 1%",
    ["丛林帽"]="丛林帽：浆果丛 2%",
    ["夏季背心"]="夏季背心：仙人掌 5%",
    ["简易的小木棚"]="简易的小木棚：仙人掌 5%",
    ["蘑菇农场"]="蘑菇农场：蘑菇 2%",
    ["黄金斧头"]="黄金斧头：蘑菇树 5%",
    ["黄金园艺锄"]="黄金园艺锄：月岛树苗 10% 石化树 5%",
    ["花纹衬衫"]="花纹衬衫：采集洞穴香蕉树 2.5%",
    ["莎草纸"]="莎草纸：芦苇 2.5%",
    ["草墙"]="草墙：芦苇 2.5%",
    ["晾肉架"]="晾肉架：尖刺灌木 5%",
    ["木栅栏"]="木栅栏：尖刺灌木 5%",
    ["便便篮"]="便便篮：洞穴苔藓 1%",
    ["真眼守卫"]="真眼守卫：诡异的植物 5%",
    ["火腿棒"]="火腿棒：疯猪 5%",
    ["小猪包"]="小猪包：疯猪 5%",
    ["大理石魔豆"]="大理石魔豆：格罗姆 33.3%",
}

--判断前缀
local function isPrefix(message) 
	local index = string.find(message,"蓝图")
	if index and index ==1 then
		return index+string.len("蓝图")
	end
	return nil
end

local function BlueprintHelper(text)
    if text == "" then
        return "请输入关键词\n\n格式：蓝图 关键词"
    end
    local help_text = ""
    for key, value in pairs(blueprint_list) do
        if string.find(tostring(key),text) ~=nil then
           help_text=help_text.."\n"..tostring(value)
        end
    end
    if help_text ~= "" then
        return help_text
    else
        return "未查询到蓝图\n\n蓝图不存在或关键词有误"
    end
end

-- 主函数
local OldNetworking_Say = _G.Networking_Say
_G.Networking_Say = function(guid, userid, name, prefab, message, colour, whisper, isemote)
	OldNetworking_Say(guid, userid, name, prefab, message, colour, whisper, isemote)
	local prefix = isPrefix(message)
	local talker = GetPlayerById(userid)
	if prefix and talker then
		local text = string.sub(message,prefix+1,string.len(message))
		PlayerSay(talker, BlueprintHelper(text), 0.1, 5)
	end
end